/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   utils.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yeongele <yeongele@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/03/17 12:00:13 by yeongele          #+#    #+#             */
/*   Updated: 2023/03/17 13:10:22 by yeongele         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "philo.h"

int	is_digit(char **av)
{
	int		i;
	int		j;
	char	c;

	i = 0;
	while (av[++i])
	{
		j = -1;
		while (av[i][++j])
		{
			if ((av[i][j] < '0' || av[i][j] > '9')
				&& (av[i][j] != '+' || av[i][j] != '-')) // ㅇㅕ기 수정
				return (0);
			else if (av[i][j] == '-' || av[i][j] == '+')
			{
				if (av[i][j + 1]
					&& (av[i][j + 1] == '-' || av[i][j + 1] == '+'))
					return (0);
				continue ;
			}
		}
	}
	return (1);
}
